//Створіть програму, в якій створіть клас «Банківський Рахунок».
//У тілі класу створіть такі поля: дата відкриття рахунку, процентна ставка
//за рахунком, сума рахунку. У тілі класу створіть такі методи: 
//1.метод, який розраховує кількість днів, починаючи з дати відкриття
//рахунку, метод має повертати цілочисельний тип даних;
//2.метод, який виводить інформацію про кількість розрахованих днів,
//метод має нічого не повертати, та використовувати функціонал попереднього
//методу для отримання інформації;
//3.метод, який розраховує суму, яка буде на рахунку через певну кількість
//років (кількість років – параметр методу);
//4.метод, який виводить інформацію про суму. Також продумати над
//конструкторами класу (які поля мають бути 100 відсотків проініціалізованими).
//У методі Main() створіть екземпляр класу «Банківський Рахунок», надайте всім
//полям значення через властивості доступу (можна використати конструктор
//класу або блок ініціалізатора), а також на екземпляр класу викличте методи
//для відображення кількості днів та суми.
