// Створіть програму, в якій створіть базовий клас Shape (фігура),
// який містить поле типу double з ім'ям Volume і метод типу double GetVolume()
// який повинен повернути об’єм фігури. Далі створіть класи: Pyramid (піраміда),
// Cylinder (циліндр), Ball (куля), які унаслідуються від класу Shape,
// реалізуйте в кожному з них метод для знаходження об'єму. Створіть клас
// Box (ящик) – фактично він є контейнером та може містити інші фігури.
// У класі Box створіть поле типу double з ім'ям DrawerVolume (обєм ящика),
// поле має зберігати об'єм скриньки. Далі у класі Box створіть метод Аdd(),
// який приймає на вхід об'єкти типу Shape, та повертає значення типу boll.
// У класі Box реалізуйте логіку для додавання нових фігур до тих пір, поки для них
// вистачає місця в Box (вважатимемо тільки об'єм, ігноруючи форму, наприклад,
// ми переливаємо рідину). Якщо місця для додавання нової фігури не вистачає,
// метод повинен повернути false.