// Створіть програму в якій опишіть клас, який визначає навчальний клас «ClassRoom»,
// після чого створіть клас студент «Student». У тілі класу створіть наступні методи
// Study(), Read(), Write(), Relax(), всі чотри методи не мають нічого повертати.
// Після чого створіть три дочірні класи відмінний студент - ExcelentStudent,
// нормальний студент - NormalStudent та поганий студент- BadStudent які є
// похідними від базового класу Student і перевизначте кожен із методів,
// залежно від успішності стденту. Конструктор класу ClassRoom має приймає
// аргументи типу Student, клас повинен складатися з максимум з 4-х учнів.
// Подумайте над можливість того, що користувач може передати 2 або 3 аргументи.
// Наведіть інформацію про те, як усі учні екземпляра класу ClassRoom уміють вчитися,
// читати, писати та відпочивати.