// Створіть програму в якій опишіть клас Document (документ). Даний клас має містити
// три методи void Headline (Заголовок), DocumentСontent (Вміст документ),
// Footer (підвал документа), методи мають бути приватними.
// Після чого в тілі класу створіть публічний метод CreateDocuсment (створити документ),
// в тілі даного методу мають почергово викликатись три приватних методи,
// що були створені раніше. Після чого створіть екземпляр класу Document,
// та на його екземплярі викличте публічний метод CreateDocuсment.
// Передивітся уважно код данної програми та подумайте де саме тут використовується інкапсуляція,
// та що таке інкапсуляція в цілому. 