// Створіть програму, в якій створіть базовий клас Person (людина),
// у класі створіть поле типу int з ім'ям BirthYear (рік народження), а також поле
// типу string з ім'ям Name та поле типу string з ім'ям Surname.
// Після чого створіть клас Student (студент) та клас Teacher (викладач).
// У класі Student додайте поле типу string[] з ім'ям Study Courses (курси, що вивчаються),
// властивість (не авто властивість) для додавання (set) і отримання (get) курсів,
// що вивчаються, і метод DisplayStudyСourses() з повертаймим значенням void,
// який буде виводити на консоль всі предмети та максимальну кількість курсів,
// що вивчаються (максимальна кількість може бути 3). У класі викладач створити поле т
// ипу Student[] з ім'ям StudentsArray, і властивість (не авто властивість) для додавання
// (set) і отримання (get) студентів. Створіть 5 екземплярів класу типу Student та ініціалізуйте
// їх довільними значеннями, та 2 екземпляри класу типу Teacher, ініціалізуйте їх довільними
// значеннями (для ініціалізації поля StudentsArray використовуйте вже створені екземпляри
// Student). Далі створіть клас PeopleInfo, у ньому створіть поле типу Person[] з ім'ям
// PeopleArray та властивість (не авто властивість) для додавання (set) та отримання (get)
// людей та метод який буде виводити всіх людей який є у полі PeopleInfo.