// Створіть програму, в якій створіть клас «Кошеня».
// У тілі класу створіть наступні поля: ім'я, вік, колір шерсті, колір очей.
// Для кожного поля створіть властивості доступу з двома методами доступу
// (get;set;), використовуйте властивості, а не автоматично реалізуємі властивості).
// Також у тілі класу створіть метод, який буде виводити на консоль «Мяу»,
// метод повинен приймати один аргумент – кількість «Мяу» кошеняти та
// виводити відповідну кількість разів «Мяу». У методі Main() створіть екземпляр
// класу «Кошеня», присвойте всім полям значення через властивості доступу
// (можна використовувати блок ініціалізатора), а також викличте метод,
// за допомогою якого «Кошеня» говорить «Мяу», в якості аргументу методу передайте 3.
