//Використовуючи Visual Studio, створіть проект за шаблоном Console Application.
//Створіть програму, де створіть клас «Трикутник». У тілі класу створіть три
//закриті поля для опису сторін трикутника та три властивості доступу для читання
//та запису. Також у тілі класу створіть 3 методи: 1 - й для розрахунку площі трикутника,
//формула для розрахунку S=√(p*(p-a)*(p-b)*(p-c) ), де p - напівпериметр трикутника,
//формула для розрахунку виглядає наступним чином: p = (a + b + c) / 2,
//де a, b, c – довжини сторін трикутника, 2-й для розрахунку периметра трикутника,
//формула для розрахунку периметру: p = (a + b + c) / 2  і 3-й для виведення інформації
//про площу та периметр трикутника. Створіть конструктор, який як аргументи приймає
//сторони трикутника та ініціалізує поля класу. У методі Main() створіть екземпляр
//класу «Трикутник», задайте довільне значення сторін трикутника та виведіть на екран
//значення периметра та площі трикутника.
