// Створіть інтерфейс IMovable, який містить метод Move(). Потім створіть два класи:
// Car і Person, які реалізують цей інтерфейс. Клас Car повинен мати поле для
// швидкості і реалізувати метод Move() для виведення повідомлення про те, що
// автомобіль рухається зі швидкістю. Клас Person повинен мати поле для ім’я та
// реалізувати метод Move() для виведення повідомлення про те, що людина йде.
// Створіть екземпляри цих класів і продемонструйте їх  приклади використання методів,
// також зробіть upcast до базового інтерфейсного типу.