// Створіть програму в якій опишіть ієрархію класів для співробітників компанії.
//Перш за все створіть базовий клас Employee з наступними полями:
//ім'я співробітника (string Name), вік співробітника (int Age) та посада
//співробітника (string Position), створіть властивості доступу до кожного із описаних полів.
//Також в класі  Employee створіть метод Work(), який нічого не повертає та виводить
//інформацію про роботу співробітника. Після чого створіть дочірній клас Manager,
//який наслідуєтся від Employee, та має додаткове поле кількість підлеглих
//(int NumberOfSubordinates) і метод Work() який має додатково виводити інформацію
//про управління підлеглими. Також створіть дочірній клас Developer, який наслідуєтся від Employee,
//з додатковими полем мова програмування (ProgrammingLanguage) і методом Work(), який
//має виводити інформацію про розробку на конкретній мові програмування.
//Після чого у методі Main створіть кілька об'єктів класів Manager і Developer,
//заповніть їх поля і викличте метод Work() для кожного об'єкта.
